const family_names = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄曲家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴鬱胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍卻璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东欧殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查后荆红游竺权逯盖益桓公万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫尉迟公羊澹台公冶宗政濮阳淳于单于太叔申屠公孙仲孙轩辕令狐钟离宇文长孙慕容鲜于闾丘司徒司空丌官司寇仉督子车颛孙端木巫马公西漆雕乐正壤驷公良拓跋夹谷宰父谷梁晋楚闫法汝鄢涂钦段干百里东郭南门呼延归海羊舌微生岳帅缑亢况郈有琴梁丘左丘东门西门商牟佘佴伯赏南宫墨哈谯笪年爱阳佟"
const names = "思怡桑佳雪蘭婕翠翠絲珊蓉秋雲靈竹紫君昕欣月媚韻甜映秋紫寧笑藍梅彤嫦姍凝荷鳳霜柳蘭雨紋玉盈佩虹靜宸宛海彥妮雅芙冰藍芳蕊虞青秋雙蕾芊萬彤芳鳳春柔笑雅醉蝶盼雁紫茹紅杏自潔姍靖艷姍香菱幼絲念寒芷卉靜芙芷潔鶯蕾迎波穎怡青絲香萱松鈴夢芹瑜菡水珠婭艷夢菡妍娜夢倚巧綠蕾音歆素英璇香卉映倚倩慕海亦甜真雁楓靜秋珊縵曉巧含珊芷幽妙君瓊霎君萍冰燕新春雪柳虞蘭紋萱蝶盈雅葵萬珠丹秋秋柏初南雪曦珍茵語琳曼梅冰婉紋菱珊芸雨霞靜曼春蘭雨珍菲珠幽雪水靈香芹芳雅蝶葵潔媛音緣穎盈紫菱沛兒麗馨蘭潔聽柏歡蝶曉綠媚沁紫兒香波紋昕谷珊涵瑤婉韻紫薇聽蝶芊雅曉迪紫怡妙菱榆曼玫桑梅青雁玉妙彤紋潔柳花鳳柔若煙海雪清嬋茹悅月爽玉虞南櫻冰萍青煙含海凝蓮君潔依雪冬雲碧霄晴桂覓荷雅霜舒霎凝甜憶珊依薇詩英盼雅旋茹熙柔緣鳳丹萱寄歡雲麗谷菱春翠紫美詩芝紫若靜嘉韻雪雲芳娜嘉海秀雅榆夏娜明曦熙芷萍霄韻娜曉燕香芷蓮蝶素鶯歆沐菲槐素芳萬英幻竹蕊馨歆芬樂松秋靈南琪妮嫣珊靜佩蓉凌舞欣月鳳青梅英水婕書倚萱虹夢雅慕荷雪慧醉珊佳怡如玉安雁佳婉卉雪雯紋虹盼柳柏凝芳青琦美紫月欣榮憐菡水碧青茜秋柔萬月漫珊嘉梅月悅曼憶依怡蓮珍映花清月丹玉韻倩柏梅綠芸佳佳嫦月沐卉睿茹燕歆柏薇芊桃含芷昕芳鳳霞虞姿紅芊竹青幻柏淑蕾艷凝"

for (const i in family_names) {
    let fname = family_names[i];
    for (let k = 0; k < names.length; k += 2) {
        let name = fname + names.substr(k, 2);
        let cn = Math.round(Math.random() * 50 + 50);
        let en = Math.round(Math.random() * 50 + 50);
        let ma = Math.round(Math.random() * 50 + 50);

        console.log(`${name},${cn},${en},${ma},n/a`);
    }
}
